<a href="https://colab.research.google.com/github/Jesuusgr072/JesusClase/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1) Descargar la base de datos

In [10]:
!gdown 1puf9UBuzaVqMW3ZMMXhd626E5yVJd_QX

Downloading...
From: https://drive.google.com/uc?id=1puf9UBuzaVqMW3ZMMXhd626E5yVJd_QX
To: /content/data_berka.db
100% 70.2M/70.2M [00:00<00:00, 127MB/s]

# 1.1) Cargamos la extension SQL (nos permite ejecutar comandos sql directamente en colab)

In [11]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%load_ext sql

# 1.2) Conectar a la Base de Datos

In [12]:
%sql sqlite:///data_berka.db

# 1.3) Comprobamos el esque de la BBDD para ejecutar comandos sql, se debe aÃ±adir "%%sql comando" o en multiples lineas "%%sql comando_linea1, comando_linea2"

In [13]:
%%sql
SELECT name, type
FROM sqlite_master
WHERE type = "table"

 * sqlite:///data_berka.db
Done.

[('DISTRICT', 'table'),
 ('ACCOUNT', 'table'),
 ('TRANS', 'table'),
 ('CLIENT', 'table'),
 ('DISPOSITION', 'table'),
 ('CREDIT_CARD', 'table'),
 ('LOAN', 'table'),
 ('PERMANENT_ORDER', 'table')]

# 2) Ejercicios

2.1) Muestre los datos de la tabla cliente

In [14]:
%%sql
SELECT *
FROM CLIENT
LIMIT 5;

 * sqlite:///data_berka.db
Done.

[(1, '706213', 18),
 (2, '450204', 1),
 (3, '406009', 1),
 (4, '561201', 5),
 (5, '605703', 5)]

2.2) Liste todos los clientes con cuentas activas y prestamos, incluyendo dinero prestado y saldos de cuenta

In [15]:
%%sql
SELECT
  c.client_id AS Cliente,
  ROUND(SUM(l.amount), 2) AS Importe_prestado,
  ROUND(SUM(CASE
    WHEN t.type = 'PRIJEM' THEN t.amount
    WHEN t.type = 'VYDAJ' THEN -t.amount
    ELSE 0
  END), 2) AS Balance_cuenta
FROM CLIENT c
LEFT JOIN DISPOSITION d ON d.client_id = c.client_id
LEFT JOIN ACCOUNT a ON a.account_id = d.account_id
LEFT JOIN LOAN l ON l.account_id = a.account_id
LEFT JOIN TRANS t ON t.account_id = a.account_id
WHERE d.type = 'OWNER'
GROUP BY c.client_id
LIMIT 10;

 * sqlite:///data_berka.db
Done.

[(1, None, 13466.5),
 (2, 38695056.0, 260069.7),
 (4, None, 51096.2),
 (6, None, 33720.6),
 (7, None, 28088.6),
 (8, None, 47667.9),
 (9, None, 68495.9),
 (10, None, 72617.3),
 (12, None, 23877.7),
 (13, None, 59295.5)]

2.3) Identifique clientes con multiples cuentas

In [16]:
%%sql
SELECT
  c.client_id AS CLIENTES,
  COUNT(a.account_id) AS NUM_CUENTAS
FROM CLIENT c
JOIN DISPOSITION d ON d.client_id = c.client_id
JOIN ACCOUNT a ON a.account_id = d.account_id
GROUP BY c.client_id
HAVING COUNT(a.account_id) > 1 AND d.type = 'OWNER'
LIMIT 5;

 * sqlite:///data_berka.db
Done.

[]

2.4) Recupere transacciones del aÃ±o 1998, ordenadas por cantidad de transacciÃ³n, e identifique las 10 transacciones mÃ¡s grandes.

In [29]:
%%sql
SELECT
  trans_id AS Transaccion,
  amount AS Cantidad,
  date AS Fecha_transaccion
FROM TRANS
WHERE date LIKE '98%'
ORDER BY amount DESC
LIMIT 10;

 * sqlite:///data_berka.db
Done.

[(291346, 87400.0, 981215),
 (1306770, 87300.0, 980606),
 (1207200, 85800.0, 980619),
 (1170721, 81900.0, 980615),
 (706371, 80100.0, 980610),
 (141211, 78300.0, 980625),
 (1155373, 78000.0, 980618),
 (623347, 77400.0, 980612),
 (768915, 77100.0, 980620),
 (816974, 76800.0, 980621)]

2.5) Â¿CuÃ¡l es el saldo promedio de cuentas con prÃ©stamos en comparaciÃ³n con aquellas sin prÃ©stamos?.

In [38]:
%%sql
SELECT
  c.client_id AS Cliente,
  l.loan_id AS Prestamo,
  l.amount AS Cantidad_Prestada
FROM CLIENT c
LEFT JOIN DISPOSITION d ON d.client_id = c.client_id
LEFT JOIN ACCOUNT a ON a.account_id = d.account_id
LEFT JOIN LOAN l ON l.account_id = a.account_id
LIMIT 5;

 * sqlite:///data_berka.db
Done.

[(1, None, None),
 (2, 4959, 80952),
 (3, 4959, 80952),
 (4, None, None),
 (5, None, None)]

In [42]:
%sql SELECT * FROM LOAN WHERE loan_id = 4959 LIMIT 10;

 * sqlite:///data_berka.db
Done.

[(4959, 2, 940105, 80952, 24, 3373, 'A')]

In [44]:
%%sql
WITH AccountBalances AS (
    SELECT
        account_id,
        SUM(CASE WHEN type = 'PRIJEM' THEN amount ELSE -amount END) AS account_balance
    FROM TRANS
    GROUP BY account_id
),
AccountsWithLoans AS (
    SELECT DISTINCT account_id
    FROM LOAN
)
SELECT
    CASE
        WHEN awl.account_id IS NOT NULL THEN 'Cuentas con PrÃ©stamos'
        ELSE 'Cuentas sin PrÃ©stamos'
    END AS Tipo_Cuenta,
    ROUND(AVG(ab.account_balance), 2) AS Saldo_Promedio
FROM AccountBalances ab
LEFT JOIN AccountsWithLoans awl ON ab.account_id = awl.account_id
GROUP BY Tipo_Cuenta;

 * sqlite:///data_berka.db
Done.

[('Cuentas con PrÃ©stamos', 50430.87), ('Cuentas sin PrÃ©stamos', 42628.98)]

2.6) Identifique clientes que hayan realizado mÃ¡s de 10 transacciones en el aÃ±o 1998 especÃ­fico pero que no hayan solicitado un prÃ©stamo.

In [58]:
%%sql
SELECT
  c.client_id AS CLIENTE,
  COUNT(t.trans_id) AS CANTIDAD_TRANSACCIONES
FROM CLIENT c
LEFT JOIN DISPOSITION d ON d.client_id = c.client_id
LEFT JOIN ACCOUNT a ON a.account_id = d.account_id
LEFT JOIN TRANS t ON t.account_id = a.account_id
LEFT JOIN LOAN l ON l.account_id = a.account_id
GROUP BY c.client_id
HAVING CANTIDAD_TRANSACCIONES > 10 AND t.date LIKE '98%' AND l.loan_id IS NULL
LIMIT 5;

 * sqlite:///data_berka.db
Done.

[]